; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v3 ?v1)
             (pred_8 ?v8 ?v12)
             (pred_7 ?v3 ?v12)
             (pred_4 ?v7 ?v3 )
	     (pred_11 ?v3)
             (pred_3 ?v2)
             (pred_1 ?v8)
             (pred_12 ?v12)
             (pred_10 ?v3)
             (pred_6 ?v8)
             (pred_2 ?v3)
             (pred_5 ))



(:action op_3
:parameters (?v11 ?v6 ?v10 ?v9)
:precondition (and (pred_3 ?v11) (pred_3 ?v6) (pred_1 ?v10) (pred_12 ?v9)
          (pred_9 ?v11 ?v6) (pred_8 ?v10 ?v9)
                   (pred_7 ?v6 ?v9) (pred_11 ?v11) 
                   (pred_10 ?v6) (pred_6 ?v10))
:effect (and  (pred_2 ?v6) (not (pred_10 ?v6))))


(:action op_5
:parameters (?v11 ?v5)
:precondition (and (pred_3 ?v11) (pred_3 ?v5)
               (pred_11 ?v11) (pred_9 ?v11 ?v5) (pred_2 ?v5))
:effect (and (pred_11 ?v5) (not (pred_11 ?v11))))

(:action op_1
:parameters (?v11 ?v10)
:precondition (and (pred_3 ?v11) (pred_1 ?v10) 
                  (pred_11 ?v11) (pred_4 ?v10 ?v11) (pred_5 ))
:effect (and (pred_6 ?v10)
   (not (pred_4 ?v10 ?v11)) (not (pred_5 ))))


(:action op_2
:parameters (?v11 ?v13 ?v4)
:precondition (and (pred_3 ?v11) (pred_1 ?v13) (pred_1 ?v4)
                  (pred_11 ?v11) (pred_6 ?v4) (pred_4 ?v13 ?v11))
:effect (and (pred_6 ?v13) (pred_4 ?v4 ?v11)
        (not (pred_6 ?v4)) (not (pred_4 ?v13 ?v11))))

(:action op_4
:parameters (?v11 ?v10)
:precondition (and (pred_3 ?v11) (pred_1 ?v10) 
                  (pred_11 ?v11) (pred_6 ?v10))
:effect (and (pred_5 ) (pred_4 ?v10 ?v11) (not (pred_6 ?v10)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_04 obj_06 obj_03 obj_07 obj_01 obj_02 obj_13 obj_12
    obj_11 obj_08
    obj_09 obj_05
    )

    (:init
       (pred_5)

       (pred_3 obj_10)
       (pred_3 obj_04)
       (pred_3 obj_06)
       (pred_3 obj_03)
       (pred_3 obj_07)
       (pred_3 obj_01)
       (pred_3 obj_02)
       (pred_3 obj_13)
       (pred_3 obj_12)
       (pred_12 obj_11)
       (pred_12 obj_08)
       (pred_1 obj_09)
       (pred_1 obj_05)

       (pred_9 obj_10 obj_03)
       (pred_9 obj_10 obj_04)
       (pred_9 obj_04 obj_07)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_04 obj_10)
       (pred_9 obj_06 obj_01)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_03 obj_02)
       (pred_9 obj_03 obj_07)
       (pred_9 obj_03 obj_10)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_07 obj_01)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_01 obj_06)
       (pred_9 obj_01 obj_07)
       (pred_9 obj_02 obj_13)
       (pred_9 obj_02 obj_03)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_12 obj_13)
       (pred_10 obj_01)
       (pred_10 obj_04)
       (pred_7  obj_01 obj_11)
       (pred_7  obj_04 obj_08)
       (pred_2 obj_10)
       (pred_2 obj_06)
       (pred_2 obj_03)
       (pred_2 obj_07)
       (pred_2 obj_02)
       (pred_2 obj_13)
       (pred_2 obj_12)

       (pred_8  obj_09 obj_11)
       (pred_8  obj_05 obj_08)
       (pred_4 obj_09 obj_10)
       (pred_4 obj_05 obj_02)
       (pred_11 obj_03)
    )

    (:goal (and
       (pred_4 obj_09 obj_12)
       (pred_4 obj_05 obj_03)
    ))
(:constraints
  (always (not (pred_11 obj_07)))
)
)

; plan
1. (op_5 obj_03 obj_02)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_02)
   goals met: 0 of 2
2. (op_1 obj_02 obj_05)
   deleted: (pred_4 obj_05 obj_02) (pred_5)
   added: (pred_6 obj_05)
   goals met: 0 of 2
3. (op_5 obj_02 obj_03)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_03)
   goals met: 0 of 2
4. (op_4 obj_03 obj_05)
   deleted: (pred_6 obj_05)
   added: (pred_5) (pred_4 obj_05 obj_03)
   goals met: 1 of 2
5. (op_5 obj_03 obj_10)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_10)
   goals met: 1 of 2
6. (op_1 obj_10 obj_09)
   deleted: (pred_4 obj_09 obj_10) (pred_5)
   added: (pred_6 obj_09)
   goals met: 1 of 2
7. (op_5 obj_10 obj_03)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_03)
   goals met: 1 of 2
8. (op_5 obj_03 obj_02)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_02)
   goals met: 1 of 2
9. (op_5 obj_02 obj_13)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_13)
   goals met: 1 of 2
10. (op_5 obj_13 obj_12)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_12)
   goals met: 1 of 2
11. (op_4 obj_12 obj_09)
   deleted: (pred_6 obj_09)
   added: (pred_5) (pred_4 obj_09 obj_12)
   goals met: 2 of 2
